INSERT INTO public."TelegramGroupCategories" ("Id", "Name", "GroupIds")
VALUES
(
    gen_random_uuid(),
    '💄 زیبایی و مراقبت',
    ARRAY[-1001239442326::bigint]
),
(
    gen_random_uuid(),
    '🏋️ ورزش و بدنسازی',
    ARRAY[
        -1001285978456::bigint,
        -1003330885295::bigint
    ]
);

INSERT INTO public."KeywordPacks" ("Id", "Name")
VALUES
    ('11111111-1111-1111-1111-111111111111', 'خرید و فروش'),
    ('22222222-2222-2222-2222-222222222222', 'استخدام'),
    ('33333333-3333-3333-3333-333333333333', 'املاک');

INSERT INTO public."Keywords"
    ("Id", "Text", "Weight", "ConfigId", "KeywordPackId")
VALUES
    -- خرید و فروش
    (gen_random_uuid(), 'خرید', 3, NULL, '11111111-1111-1111-1111-111111111111'),
    (gen_random_uuid(), 'فروش', 3, NULL, '11111111-1111-1111-1111-111111111111'),
    (gen_random_uuid(), 'قیمت', 2, NULL, '11111111-1111-1111-1111-111111111111'),
    (gen_random_uuid(), 'ارزان', 2, NULL, '11111111-1111-1111-1111-111111111111'),

    -- استخدام
    (gen_random_uuid(), 'کار', 5, NULL, '22222222-2222-2222-2222-222222222222'),
    (gen_random_uuid(), 'استخدام', 5, NULL, '22222222-2222-2222-2222-222222222222'),
    (gen_random_uuid(), 'فرصت شغلی', 4, NULL, '22222222-2222-2222-2222-222222222222'),
    (gen_random_uuid(), 'دورکاری', 3, NULL, '22222222-2222-2222-2222-222222222222'),

    -- املاک
    (gen_random_uuid(), 'آپارتمان', 5, NULL, '33333333-3333-3333-3333-333333333333'),
    (gen_random_uuid(), 'خانه', 5, NULL, '33333333-3333-3333-3333-333333333333'),
    (gen_random_uuid(), 'اجاره', 4, NULL, '33333333-3333-3333-3333-333333333333'),
    (gen_random_uuid(), 'ملک', 3, NULL, '33333333-3333-3333-3333-333333333333');
